interface Country {
    e: string;
    n: string;
    d: string;
}

const countries: Country[] = [
    {
        "e": "🇦🇫",
        "n": "Afghanistan",
        "d": "+93"
    },
    {
        "e": "🇦🇱",
        "n": "Albania",
        "d": "+355"
    },
    {
        "e": "🇩🇿",
        "n": "Algeria",
        "d": "+213"
    },
    {
        "e": "🇦🇸",
        "n": "American Samoa",
        "d": "+1684"
    },
    {
        "e": "🇦🇩",
        "n": "Andorra",
        "d": "+376"
    },
    {
        "e": "🇦🇴",
        "n": "Angola",
        "d": "+244"
    },
    {
        "e": "🇦🇮",
        "n": "Anguilla",
        "d": "+1264"
    },
    {
        "e": "🇦🇬",
        "n": "Antigua and Barbuda",
        "d": "+1268"
    },
    {
        "e": "🇦🇷",
        "n": "Argentina",
        "d": "+54"
    },
    {
        "e": "🇦🇲",
        "n": "Armenia",
        "d": "+374"
    },
    {
        "e": "🇦🇼",
        "n": "Aruba",
        "d": "+297"
    },
    {
        "e": "🇦🇺",
        "n": "Australia",
        "d": "+61"
    },
    {
        "e": "🇦🇹",
        "n": "Austria",
        "d": "+43"
    },
    {
        "e": "🇦🇿",
        "n": "Azerbaijan",
        "d": "+994"
    },
    {
        "e": "🇧🇸",
        "n": "Bahamas",
        "d": "+1242"
    },
    {
        "e": "🇧🇭",
        "n": "Bahrain",
        "d": "+973"
    },
    {
        "e": "🇧🇩",
        "n": "Bangladesh",
        "d": "+880"
    },
    {
        "e": "🇧🇧",
        "n": "Barbados",
        "d": "+1246"
    },
    {
        "e": "🇧🇾",
        "n": "Belarus",
        "d": "+375"
    },
    {
        "e": "🇧🇪",
        "n": "Belgium",
        "d": "+32"
    },
    {
        "e": "🇧🇿",
        "n": "Belize",
        "d": "+501"
    },
    {
        "e": "🇧🇯",
        "n": "Benin",
        "d": "+229"
    },
    {
        "e": "🇧🇲",
        "n": "Bermuda",
        "d": "+1441"
    },
    {
        "e": "🇧🇹",
        "n": "Bhutan",
        "d": "+975"
    },
    {
        "e": "🇧🇴",
        "n": "Bolivia",
        "d": "+591"
    },
    {
        "e": "🇧🇦",
        "n": "Bosnia and Herzegovina",
        "d": "+387"
    },
    {
        "e": "🇧🇼",
        "n": "Botswana",
        "d": "+267"
    },
    {
        "e": "🇧🇷",
        "n": "Brazil",
        "d": "+55"
    },
    {
        "e": "🇮🇴",
        "n": "British Indian Ocean Territory",
        "d": "+246"
    },
    {
        "e": "🇧🇳",
        "n": "Brunei Darussalam",
        "d": "+673"
    },
    {
        "e": "🇧🇬",
        "n": "Bulgaria",
        "d": "+359"
    },
    {
        "e": "🇧🇫",
        "n": "Burkina Faso",
        "d": "+226"
    },
    {
        "e": "🇧🇮",
        "n": "Burundi",
        "d": "+257"
    },
    {
        "e": "🇰🇭",
        "n": "Cambodia",
        "d": "+855"
    },
    {
        "e": "🇨🇲",
        "n": "Cameroon",
        "d": "+237"
    },
    {
        "e": "🇨🇦",
        "n": "Canada",
        "d": "+1"
    },
    {
        "e": "🇨🇻",
        "n": "Cape Verde",
        "d": "+238"
    },
    {
        "e": "🇰🇾",
        "n": "Cayman Islands",
        "d": "+345"
    },
    {
        "e": "🇨🇫",
        "n": "Central African Republic",
        "d": "+236"
    },
    {
        "e": "🇹🇩",
        "n": "Chad",
        "d": "+235"
    },
    {
        "e": "🇨🇱",
        "n": "Chile",
        "d": "+56"
    },
    {
        "e": "🇨🇳",
        "n": "China",
        "d": "+86"
    },
    {
        "e": "🇨🇽",
        "n": "Christmas Island",
        "d": "+61"
    },
    {
        "e": "🇨🇨",
        "n": "Cocos (Keeling) Islands",
        "d": "+61"
    },
    {
        "e": "🇨🇴",
        "n": "Colombia",
        "d": "+57"
    },
    {
        "e": "🇰🇲",
        "n": "Comoros",
        "d": "+269"
    },
    {
        "e": "🇨🇬",
        "n": "Congo",
        "d": "+242"
    },
    {
        "e": "🇨🇩",
        "n": "Congo",
        "d": "+243"
    },
    {
        "e": "🇨🇰",
        "n": "Cook Islands",
        "d": "+682"
    },
    {
        "e": "🇨🇷",
        "n": "Costa Rica",
        "d": "+506"
    },
    {
        "e": "🇭🇷",
        "n": "Croatia",
        "d": "+385"
    },
    {
        "e": "🇨🇺",
        "n": "Cuba",
        "d": "+53"
    },
    {
        "e": "🇨🇾",
        "n": "Cyprus",
        "d": "+537"
    },
    {
        "e": "🇨🇿",
        "n": "Czech Republic",
        "d": "+420"
    },
    {
        "e": "🇨🇮",
        "n": "Côte D'Ivoire",
        "d": "+225"
    },
    {
        "e": "🇩🇰",
        "n": "Denmark",
        "d": "+45"
    },
    {
        "e": "🇩🇯",
        "n": "Djibouti",
        "d": "+253"
    },
    {
        "e": "🇩🇲",
        "n": "Dominica",
        "d": "+1767"
    },
    {
        "e": "🇩🇴",
        "n": "Dominican Republic",
        "d": "+1849"
    },
    {
        "e": "🇪🇨",
        "n": "Ecuador",
        "d": "+593"
    },
    {
        "e": "🇪🇬",
        "n": "Egypt",
        "d": "+20"
    },
    {
        "e": "🇸🇻",
        "n": "El Salvador",
        "d": "+503"
    },
    {
        "e": "🇬🇶",
        "n": "Equatorial Guinea",
        "d": "+240"
    },
    {
        "e": "🇪🇷",
        "n": "Eritrea",
        "d": "+291"
    },
    {
        "e": "🇪🇪",
        "n": "Estonia",
        "d": "+372"
    },
    {
        "e": "🇪🇹",
        "n": "Ethiopia",
        "d": "+251"
    },
    {
        "e": "🇫🇰",
        "n": "Falkland Islands (Malvinas)",
        "d": "+500"
    },
    {
        "e": "🇫🇴",
        "n": "Faroe Islands",
        "d": "+298"
    },
    {
        "e": "🇫🇯",
        "n": "Fiji",
        "d": "+679"
    },
    {
        "e": "🇫🇮",
        "n": "Finland",
        "d": "+358"
    },
    {
        "e": "🇫🇷",
        "n": "France",
        "d": "+33"
    },
    {
        "e": "🇬🇫",
        "n": "French Guiana",
        "d": "+594"
    },
    {
        "e": "🇵🇫",
        "n": "French Polynesia",
        "d": "+689"
    },
    {
        "e": "🇬🇦",
        "n": "Gabon",
        "d": "+241"
    },
    {
        "e": "🇬🇲",
        "n": "Gambia",
        "d": "+220"
    },
    {
        "e": "🇬🇪",
        "n": "Georgia",
        "d": "+995"
    },
    {
        "e": "🇩🇪",
        "n": "Germany",
        "d": "+49"
    },
    {
        "e": "🇬🇭",
        "n": "Ghana",
        "d": "+233"
    },
    {
        "e": "🇬🇮",
        "n": "Gibraltar",
        "d": "+350"
    },
    {
        "e": "🇬🇷",
        "n": "Greece",
        "d": "+30"
    },
    {
        "e": "🇬🇱",
        "n": "Greenland",
        "d": "+299"
    },
    {
        "e": "🇬🇩",
        "n": "Grenada",
        "d": "+1473"
    },
    {
        "e": "🇬🇵",
        "n": "Guadeloupe",
        "d": "+590"
    },
    {
        "e": "🇬🇺",
        "n": "Guam",
        "d": "+1671"
    },
    {
        "e": "🇬🇹",
        "n": "Guatemala",
        "d": "+502"
    },
    {
        "e": "🇬🇬",
        "n": "Guernsey",
        "d": "+44"
    },
    {
        "e": "🇬🇳",
        "n": "Guinea",
        "d": "+224"
    },
    {
        "e": "🇬🇼",
        "n": "Guinea-Bissau",
        "d": "+245"
    },
    {
        "e": "🇬🇾",
        "n": "Guyana",
        "d": "+595"
    },
    {
        "e": "🇭🇹",
        "n": "Haiti",
        "d": "+509"
    },
    {
        "e": "🇭🇳",
        "n": "Honduras",
        "d": "+504"
    },
    {
        "e": "🇭🇰",
        "n": "Hong Kong",
        "d": "+852"
    },
    {
        "e": "🇭🇺",
        "n": "Hungary",
        "d": "+36"
    },
    {
        "e": "🇮🇸",
        "n": "Iceland",
        "d": "+354"
    },
    {
        "e": "🇮🇳",
        "n": "India",
        "d": "+91"
    },
    {
        "e": "🇮🇩",
        "n": "Indonesia",
        "d": "+62"
    },
    {
        "e": "🇮🇷",
        "n": "Iran",
        "d": "+98"
    },
    {
        "e": "🇮🇶",
        "n": "Iraq",
        "d": "+964"
    },
    {
        "e": "🇮🇪",
        "n": "Ireland",
        "d": "+353"
    },
    {
        "e": "🇮🇲",
        "n": "Isle of Man",
        "d": "+44"
    },
    {
        "e": "🇮🇱",
        "n": "Israel",
        "d": "+972"
    },
    {
        "e": "🇮🇹",
        "n": "Italy",
        "d": "+39"
    },
    {
        "e": "🇯🇲",
        "n": "Jamaica",
        "d": "+1876"
    },
    {
        "e": "🇯🇵",
        "n": "Japan",
        "d": "+81"
    },
    {
        "e": "🇯🇪",
        "n": "Jersey",
        "d": "+44"
    },
    {
        "e": "🇯🇴",
        "n": "Jordan",
        "d": "+962"
    },
    {
        "e": "🇰🇿",
        "n": "Kazakhstan",
        "d": "+77"
    },
    {
        "e": "🇰🇪",
        "n": "Kenya",
        "d": "+254"
    },
    {
        "e": "🇰🇮",
        "n": "Kiribati",
        "d": "+686"
    },
    {
        "e": "🇽🇰",
        "n": "Kosovo",
        "d": "+383"
    },
    {
        "e": "🇰🇼",
        "n": "Kuwait",
        "d": "+965"
    },
    {
        "e": "🇰🇬",
        "n": "Kyrgyzstan",
        "d": "+996"
    },
    {
        "e": "🇱🇦",
        "n": "Lao People's Democratic Republic",
        "d": "+856"
    },
    {
        "e": "🇱🇻",
        "n": "Latvia",
        "d": "+371"
    },
    {
        "e": "🇱🇧",
        "n": "Lebanon",
        "d": "+961"
    },
    {
        "e": "🇱🇸",
        "n": "Lesotho",
        "d": "+266"
    },
    {
        "e": "🇱🇷",
        "n": "Liberia",
        "d": "+231"
    },
    {
        "e": "🇱🇾",
        "n": "Libya",
        "d": "+218"
    },
    {
        "e": "🇱🇮",
        "n": "Liechtenstein",
        "d": "+423"
    },
    {
        "e": "🇱🇹",
        "n": "Lithuania",
        "d": "+370"
    },
    {
        "e": "🇱🇺",
        "n": "Luxembourg",
        "d": "+352"
    },
    {
        "e": "🇲🇴",
        "n": "Macao",
        "d": "+853"
    },
    {
        "e": "🇲🇰",
        "n": "Macedonia",
        "d": "+389"
    },
    {
        "e": "🇲🇬",
        "n": "Madagascar",
        "d": "+261"
    },
    {
        "e": "🇲🇼",
        "n": "Malawi",
        "d": "+265"
    },
    {
        "e": "🇲🇾",
        "n": "Malaysia",
        "d": "+60"
    },
    {
        "e": "🇲🇻",
        "n": "Maldives",
        "d": "+960"
    },
    {
        "e": "🇲🇱",
        "n": "Mali",
        "d": "+223"
    },
    {
        "e": "🇲🇹",
        "n": "Malta",
        "d": "+356"
    },
    {
        "e": "🇲🇭",
        "n": "Marshall Islands",
        "d": "+692"
    },
    {
        "e": "🇲🇶",
        "n": "Martinique",
        "d": "+596"
    },
    {
        "e": "🇲🇷",
        "n": "Mauritania",
        "d": "+222"
    },
    {
        "e": "🇲🇺",
        "n": "Mauritius",
        "d": "+230"
    },
    {
        "e": "🇾🇹",
        "n": "Mayotte",
        "d": "+262"
    },
    {
        "e": "🇲🇽",
        "n": "Mexico",
        "d": "+52"
    },
    {
        "e": "🇫🇲",
        "n": "Micronesia",
        "d": "+691"
    },
    {
        "e": "🇲🇩",
        "n": "Moldova",
        "d": "+373"
    },
    {
        "e": "🇲🇨",
        "n": "Monaco",
        "d": "+377"
    },
    {
        "e": "🇲🇳",
        "n": "Mongolia",
        "d": "+976"
    },
    {
        "e": "🇲🇪",
        "n": "Montenegro",
        "d": "+382"
    },
    {
        "e": "🇲🇸",
        "n": "Montserrat",
        "d": "+1664"
    },
    {
        "e": "🇲🇦",
        "n": "Morocco",
        "d": "+212"
    },
    {
        "e": "🇲🇿",
        "n": "Mozambique",
        "d": "+258"
    },
    {
        "e": "🇲🇲",
        "n": "Myanmar",
        "d": "+95"
    },
    {
        "e": "🇳🇦",
        "n": "Namibia",
        "d": "+264"
    },
    {
        "e": "🇳🇷",
        "n": "Nauru",
        "d": "+674"
    },
    {
        "e": "🇳🇵",
        "n": "Nepal",
        "d": "+977"
    },
    {
        "e": "🇳🇱",
        "n": "Netherlands",
        "d": "+31"
    },
    {
        "e": "🇳🇨",
        "n": "New Caledonia",
        "d": "+687"
    },
    {
        "e": "🇳🇿",
        "n": "New Zealand",
        "d": "+64"
    },
    {
        "e": "🇳🇮",
        "n": "Nicaragua",
        "d": "+505"
    },
    {
        "e": "🇳🇪",
        "n": "Niger",
        "d": "+227"
    },
    {
        "e": "🇳🇬",
        "n": "Nigeria",
        "d": "+234"
    },
    {
        "e": "🇳🇺",
        "n": "Niue",
        "d": "+683"
    },
    {
        "e": "🇳🇫",
        "n": "Norfolk Island",
        "d": "+672"
    },
    {
        "e": "🇰🇵",
        "n": "North Korea",
        "d": "+850"
    },
    {
        "e": "🇲🇵",
        "n": "Northern Mariana Islands",
        "d": "+1670"
    },
    {
        "e": "🇳🇴",
        "n": "Norway",
        "d": "+47"
    },
    {
        "e": "🇴🇲",
        "n": "Oman",
        "d": "+968"
    },
    {
        "e": "🇵🇰",
        "n": "Pakistan",
        "d": "+92"
    },
    {
        "e": "🇵🇼",
        "n": "Palau",
        "d": "+680"
    },
    {
        "e": "🇵🇸",
        "n": "Palestinian Territory",
        "d": "+970"
    },
    {
        "e": "🇵🇦",
        "n": "Panama",
        "d": "+507"
    },
    {
        "e": "🇵🇬",
        "n": "Papua New Guinea",
        "d": "+675"
    },
    {
        "e": "🇵🇾",
        "n": "Paraguay",
        "d": "+595"
    },
    {
        "e": "🇵🇪",
        "n": "Peru",
        "d": "+51"
    },
    {
        "e": "🇵🇭",
        "n": "Philippines",
        "d": "+63"
    },
    {
        "e": "🇵🇳",
        "n": "Pitcairn",
        "d": "+872"
    },
    {
        "e": "🇵🇱",
        "n": "Poland",
        "d": "+48"
    },
    {
        "e": "🇵🇹",
        "n": "Portugal",
        "d": "+351"
    },
    {
        "e": "🇵🇷",
        "n": "Puerto Rico",
        "d": "+1939"
    },
    {
        "e": "🇶🇦",
        "n": "Qatar",
        "d": "+974"
    },
    {
        "e": "🇷🇴",
        "n": "Romania",
        "d": "+40"
    },
    {
        "e": "🇷🇺",
        "n": "Russia",
        "d": "+7"
    },
    {
        "e": "🇷🇼",
        "n": "Rwanda",
        "d": "+250"
    },
    {
        "e": "🇷🇪",
        "n": "Réunion",
        "d": "+262"
    },
    {
        "e": "🇧🇱",
        "n": "Saint Barthélemy",
        "d": "+590"
    },
    {
        "e": "🇸🇭",
        "n": "Saint Helena, Ascension and Tristan Da Cunha",
        "d": "+290"
    },
    {
        "e": "🇰🇳",
        "n": "Saint Kitts and Nevis",
        "d": "+1869"
    },
    {
        "e": "🇱🇨",
        "n": "Saint Lucia",
        "d": "+1758"
    },
    {
        "e": "🇲🇫",
        "n": "Saint Martin (French Part)",
        "d": "+590"
    },
    {
        "e": "🇵🇲",
        "n": "Saint Pierre and Miquelon",
        "d": "+508"
    },
    {
        "e": "🇻🇨",
        "n": "Saint Vincent and The Grenadines",
        "d": "+1784"
    },
    {
        "e": "🇼🇸",
        "n": "Samoa",
        "d": "+685"
    },
    {
        "e": "🇸🇲",
        "n": "San Marino",
        "d": "+378"
    },
    {
        "e": "🇸🇹",
        "n": "Sao Tome and Principe",
        "d": "+239"
    },
    {
        "e": "🇸🇦",
        "n": "Saudi Arabia",
        "d": "+966"
    },
    {
        "e": "🇸🇳",
        "n": "Senegal",
        "d": "+221"
    },
    {
        "e": "🇷🇸",
        "n": "Serbia",
        "d": "+381"
    },
    {
        "e": "🇸🇨",
        "n": "Seychelles",
        "d": "+248"
    },
    {
        "e": "🇸🇱",
        "n": "Sierra Leone",
        "d": "+232"
    },
    {
        "e": "🇸🇬",
        "n": "Singapore",
        "d": "+65"
    },
    {
        "e": "🇸🇰",
        "n": "Slovakia",
        "d": "+421"
    },
    {
        "e": "🇸🇮",
        "n": "Slovenia",
        "d": "+386"
    },
    {
        "e": "🇸🇧",
        "n": "Solomon Islands",
        "d": "+677"
    },
    {
        "e": "🇸🇴",
        "n": "Somalia",
        "d": "+252"
    },
    {
        "e": "🇿🇦",
        "n": "South Africa",
        "d": "+27"
    },
    {
        "e": "🇬🇸",
        "n": "South Georgia",
        "d": "+500"
    },
    {
        "e": "🇰🇷",
        "n": "South Korea",
        "d": "+82"
    },
    {
        "e": "🇪🇸",
        "n": "Spain",
        "d": "+34"
    },
    {
        "e": "🇱🇰",
        "n": "Sri Lanka",
        "d": "+94"
    },
    {
        "e": "🇸🇩",
        "n": "Sudan",
        "d": "+249"
    },
    {
        "e": "🇸🇷",
        "n": "Suriname",
        "d": "+597"
    },
    {
        "e": "🇸🇯",
        "n": "Svalbard and Jan Mayen",
        "d": "+47"
    },
    {
        "e": "🇸🇿",
        "n": "Swaziland",
        "d": "+268"
    },
    {
        "e": "🇸🇪",
        "n": "Sweden",
        "d": "+46"
    },
    {
        "e": "🇨🇭",
        "n": "Switzerland",
        "d": "+41"
    },
    {
        "e": "🇸🇾",
        "n": "Syrian Arab Republic",
        "d": "+963"
    },
    {
        "e": "🇹🇼",
        "n": "Taiwan",
        "d": "+886"
    },
    {
        "e": "🇹🇯",
        "n": "Tajikistan",
        "d": "+992"
    },
    {
        "e": "🇹🇿",
        "n": "Tanzania",
        "d": "+255"
    },
    {
        "e": "🇹🇭",
        "n": "Thailand",
        "d": "+66"
    },
    {
        "e": "🇹🇱",
        "n": "Timor-Leste",
        "d": "+670"
    },
    {
        "e": "🇹🇬",
        "n": "Togo",
        "d": "+228"
    },
    {
        "e": "🇹🇰",
        "n": "Tokelau",
        "d": "+690"
    },
    {
        "e": "🇹🇴",
        "n": "Tonga",
        "d": "+676"
    },
    {
        "e": "🇹🇹",
        "n": "Trinidad and Tobago",
        "d": "+1868"
    },
    {
        "e": "🇹🇳",
        "n": "Tunisia",
        "d": "+216"
    },
    {
        "e": "🇹🇷",
        "n": "Turkey",
        "d": "+90"
    },
    {
        "e": "🇹🇲",
        "n": "Turkmenistan",
        "d": "+993"
    },
    {
        "e": "🇹🇨",
        "n": "Turks and Caicos Islands",
        "d": "+1649"
    },
    {
        "e": "🇹🇻",
        "n": "Tuvalu",
        "d": "+688"
    },
    {
        "e": "🇺🇬",
        "n": "Uganda",
        "d": "+256"
    },
    {
        "e": "🇺🇦",
        "n": "Ukraine",
        "d": "+380"
    },
    {
        "e": "🇦🇪",
        "n": "United Arab Emirates",
        "d": "+971"
    },
    {
        "e": "🇬🇧",
        "n": "United Kingdom",
        "d": "+44"
    },
    {
        "e": "🇺🇸",
        "n": "United States",
        "d": "+1"
    },
    {
        "e": "🇺🇾",
        "n": "Uruguay",
        "d": "+598"
    },
    {
        "e": "🇺🇿",
        "n": "Uzbekistan",
        "d": "+998"
    },
    {
        "e": "🇻🇺",
        "n": "Vanuatu",
        "d": "+678"
    },
    {
        "e": "🇻🇦",
        "n": "Vatican City",
        "d": "+379"
    },
    {
        "e": "🇻🇪",
        "n": "Venezuela",
        "d": "+58"
    },
    {
        "e": "🇻🇳",
        "n": "Viet Nam",
        "d": "+84"
    },
    {
        "e": "🇻🇬",
        "n": "Virgin Islands, British",
        "d": "+1284"
    },
    {
        "e": "🇻🇮",
        "n": "Virgin Islands, U.S.",
        "d": "+1340"
    },
    {
        "e": "🇼🇫",
        "n": "Wallis and Futuna",
        "d": "+681"
    },
    {
        "e": "🇾🇪",
        "n": "Yemen",
        "d": "+967"
    },
    {
        "e": "🇿🇲",
        "n": "Zambia",
        "d": "+260"
    },
    {
        "e": "🇿🇼",
        "n": "Zimbabwe",
        "d": "+263"
    },
    {
        "e": "",
        "n": "Telegram Test",
        "d": "+99966"
    }
];

export default countries;
